IgorSkl/logikaMRZV/LIB/CDL_AV0/csps/lpc32xx/source/lpcAV1_hsuart_driver.c
/***********************************************************************
 * $Id: lpc32xx_hsuart_driver.c 35145 2010-03-19 18:10:17Z anderslu $
 *
 * Project: LPC3xxx High Speed UART driver
 *
 * Description:
 *     This file contains driver support for the LPC3xxx HS UART
 *
 ***********************************************************************
 * Software that is described herein is for illustrative purposes only
 * which provides customers with programming information regarding the
 * products. This software is supplied "AS IS" without any warranties.
 * NXP Semiconductors assumes no responsibility or liability for the
 * use of the software, conveys no license or title under any patent,
 * copyright, or mask work right to the product. NXP Semiconductors
 * reserves the right to make changes in the software without
 * notification. NXP Semiconductors also make no representation or
 * warranty that such application will be suitable for the specified
 * use without further testing or modification.
 *********************************************************************/

#include "../include/lpc32xx_uart.h"
#include "../include/lpc32xx_hsuart_driver.h"
#include "../include/lpc32xx_intc_driver.h"
#include "../include/lpc32xx_clkpwr_driver.h"
#include "../include/lpc32xx_timer_driver.h"
#include "lpc_irq_fiq.h"
/***********************************************************************
 * HSUART driver package data
***********************************************************************/
extern unsigned char chEntry_Hs7;
extern unsigned char chHdwErorHSU7;
extern unsigned char chEntry_Hs2;
extern unsigned char chHdwErorHSU2;
extern unsigned char chEntry_Hs1;
extern unsigned char chHdwErorHSU1;
extern unsigned long lTmrHSU2Val;
/* HSUART driver data */
static HSUART_CFG_T hs_uart_dat [3];

/***********************************************************************
 * HSUART driver private functions
 **********************************************************************/

/***********************************************************************
 *
 * Function: hsuart_gen_int_handler
 *
 * Purpose: General HS UART interrupt handler and router
 *
 * Processing:
 *     Handles transmit, receive, and status interrupts for the HS UART.
 *     Based on the interrupt status, routes the interrupt to the
 *     respective callback to be handled by the user application using
 *     this driver.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: If a callback doesn't exist, the interrupt will be disabled.
 *
 **********************************************************************/
void hs_uart_gen_int_handler(HSUART_CFG_T *phsuartcfg)
{
  volatile UNS_32 tmp;
  long il;

  /* Determine the interrupt source */
  tmp = phsuartcfg->regptr->iir;
  il = 0;

  if ((tmp & (HSU_RX_TRIG_INT | HSU_RX_TIMEOUT_INT)) != 0)
  {
    /* RX interrupt, needs servicing */
    if (phsuartcfg->cbs.rxcb != NULL)
    {
      phsuartcfg->cbs.rxcb(&phsuartcfg);
	  
	    if(tmp & HSU_RX_TIMEOUT_INT)
	    {
		  if (phsuartcfg->cbs.eofcb != NULL)
		  phsuartcfg->cbs.eofcb();
	    }
	  il++;
    }
    else
    {
      /* No callback, disable interrupt */
      phsuartcfg->regptr->ctrl &= ~HSU_RX_INT_EN;
	  	  
    }
  }

  if ((tmp & HSU_TX_INT) != 0)
  {
    /* TX interrupt, needs servicing */
    if (phsuartcfg->cbs.txcb != NULL)
    {
      //phsuartcfg->regptr->ctrl &= ~HSU_TX_INT_EN;
	  phsuartcfg->cbs.txcb(&phsuartcfg);
	  //phsuartcfg->regptr->ctrl |= HSU_TX_INT_EN;
    }
    else
    {
      /* No callback, disable interrupt */
      phsuartcfg->regptr->ctrl &= ~HSU_TX_INT_EN;
    }
  }

  if ((tmp & (HSU_RX_OE_INT | HSU_BRK_INT | HSU_FE_INT)) != 0)
  {
    /* Error interrupt, needs servicing */
    if (phsuartcfg->cbs.rxerrcb != NULL)
    {
      phsuartcfg->cbs.rxerrcb(&phsuartcfg);
    }
    else
    {
      /* No callback, disable interrupt */
      phsuartcfg->regptr->ctrl &= ~HSU_ERR_INT_EN;
    }
  }
    
	if(il==0) return;//Frease on receive
	il = hs_uart_ptr_to_hsuart_num(phsuartcfg->regptr);
	switch (il )
	{
		case 0:
		
		    il = (1<<IRQ_UART_IIR1);
			il &= MIC->rsr;
			if(il )   //  
			{
			    MIC-> er &= ~il;//~tmp;
				phsuartcfg->regptr->ctrl &= ~(HSU_RX_INT_EN);
				//MIC-> er |= tmp;	
				chEntry_Hs1++;
				chHdwErorHSU1++;
			}
			
		break;
		case 1:
		
			il = (1<<IRQ_UART_IIR2);
			il &= MIC->rsr;
			if(il )   //  
			{
			    MIC-> er &= ~il;//~tmp;
				phsuartcfg->regptr->ctrl &= ~(HSU_RX_INT_EN);
				//MIC-> er |= tmp;	
				chEntry_Hs2++;
				chHdwErorHSU2++;
			}
		break;
		case 2:
		    il = (1<<IRQ_UART_IIR7);
			il &= MIC->rsr;
			if(il )   //  
			{
			    MIC-> er &= ~il;//~tmp;
				phsuartcfg->regptr->ctrl &= ~(HSU_RX_INT_EN);
				//MIC-> er |= tmp;	
				chEntry_Hs7++;
				chHdwErorHSU7++;
			}
		break;
	 default:
		;
	}

	
  //else
  //MIC-> er |= tmp;
  
}

/***********************************************************************
 *
 * Function: uart1_int_handler
 *
 * Purpose: UART1 interrupt handler and router
 *
 * Processing:
 *     Handles UART 1 interrupt by routing the to general handler with
 *     the UART 1 driver data.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void hs_uart1_int_handler(void)
{
  //hs_uart_gen_int_handler(&hsuartdat[0]);
  //int_disable(IRQ_UART_IIR1);
  hs_uart_gen_int_handler(&hs_uart_dat[0]);
  //int_enable(IRQ_UART_IIR1);
}

/***********************************************************************
 *
 * Function: uart2_int_handler
 *
 * Purpose: UART2 interrupt handler and router
 *
 * Processing:
 *     Handles UART 2 interrupt by routing the to general handler with
 *     the UART 2 driver data.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void hs_uart2_int_handler(void)
{
  //hs_uart_gen_int_handler(&hsuartdat[1]);
  //Int_disable(IRQ_UART_IIR2);
  hs_uart_gen_int_handler(&hs_uart_dat[1]);
  //Int_enable(IRQ_UART_IIR2);
}

/***********************************************************************
 *
 * Function: uart7_int_handler
 *
 * Purpose: UART7 interrupt handler and router
 *
 * Processing:
 *     Handles UART 7 interrupt by routing the to general handler with
 *     the UART 7 driver data.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void hs_uart7_int_handler(void)
{
  //hsuart_gen_int_handler(&hsuartdat[2]);
  //disable_irq_fiq();
  hs_uart_gen_int_handler(&hs_uart_dat[2]);
 //enable_irq_fiq();
}

/***********************************************************************
 *
 * Function: hsuart_abs
 *
 * Purpose: ABS difference function
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     v1 : Value 1 for ABS
 *     v2 : Value 2 for ABS
 *
 * Outputs: None
 *
 * Returns: Absolute difference between the 2 values
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 hsuart_abs(INT_32 v1, INT_32 v2)
{
  if (v1 > v2)
  {
    return v1 - v2;
  }

  return v2 - v1;
}

/***********************************************************************
 *
 * Function: hsuart_ptr_to_hsuart_num
 *
 * Purpose: Convert a HS UART register pointer to a HS UART number
 *
 * Processing:
 *     Based on the passed HS UART address, return the HS UART number.
 *
 * Parameters:
 *     puart : Pointer to a HS UART register set
 *
 * Outputs: None
 *
 * Returns: The HS UART number (0 to 2) or -1 if register pointer is bad
 *
 **********************************************************************/
INT_32 hs_uart_ptr_to_hsuart_num(HSUART_REGS_T *phsuart)
{
  INT_32 hsuartnum = -1;

  if (phsuart == UART1)
  {
    hsuartnum = 0; /* UART 1 */
  }
  else if (phsuart == UART2)
  {
    hsuartnum = 1; /* UART 2 */
  }
  else if (phsuart == UART7)
  {
    hsuartnum = 2; /* UART 7 */
  }

