IgorSkl/logikaMRZV/LIB/CDL_AV0/csps/lpc32xx/source/lpcAV1_hsuart_driver.c
  return hsuartnum;
}

/***********************************************************************
 *
 * Function: hsuart_flush_fifos
 *
 * Purpose: Flushes one or both of the HS UART FIFOs
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     pregs     : Pointer to a HS UART register base
 *     flushword : Masked flush value
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void hs_uart_flush_fifos(HSUART_REGS_T *pregs,
                        UNS_32 flushword)
{
  UNS_8 dummy = 0;

  (void) dummy;

  while ((pregs->level & 0xFF00) != 0);
  while ((pregs->level & 0xFF) != 0)
  {
    dummy =	pregs->txrx_fifo;
  }
}

/***********************************************************************
 *
 * Function: hsuart_find_clk
 *
 * Purpose: Determines best divider to get a target clock rate
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     hsuartnum : HSUART number (0..2) for HS UARTS (1, 2, 7)
 *     freq      : Desired HS UART baud rate
 *     div       : Structure to place dividers to get rate into
 *
 * Outputs: None
 *
 * Returns: Actual HS UART baud rate
 *
 * Notes: None
 *
 **********************************************************************/
UNS_32 hs_uart_find_clk(UNS_32 freq,
                       HSUART_CFG_T *phsuartcfg)
{
  UNS_32 clkrate, savedclkrate, diff, basepclk;
  INT_32 idiv, divider;

  /* Get the clock rate for the UART block */
  basepclk = clkpwr_get_base_clock_rate(CLKPWR_PERIPH_CLK);

  /* Find the best divider */
  divider = 0;
  savedclkrate = 0;
  diff = 0xFFFFFFFF;
  for (idiv = 0; idiv < 0x100; idiv++)
  {
    clkrate = basepclk / (14 * (idiv + 1));
    if (hsuart_abs(clkrate, freq) < diff)
    {
      diff = hsuart_abs(clkrate, freq);
      savedclkrate = clkrate;
      divider = idiv;
    }
  }

  /* Saved computed divider */
  phsuartcfg->divider = divider;

  return savedclkrate;
}

/***********************************************************************
 *
 * Function: hsuart_setup_trans_mode
 *
 * Purpose: Sets up a HS UART data transfer mode
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     puartcfg   : Pointer to HS UART configuration data
 *     puartsetup : Pointer to a HS UART transfer mode setup structure
 *
 * Outputs: None
 *
 * Returns: _NO_ERROR if setup was ok, otherwise _ERROR
 *
 * Notes: None
 *
 **********************************************************************/
STATUS hs_uart_setup_trans_mode(HSUART_CFG_T *phsuartcfg,
                               HSUART_CONTROL_T *phsuartsetup)
{
  STATUS err = _NO_ERROR;

  /* Find closest baud rate for desired clock frequency */
  phsuartcfg->baudrate = hs_uart_find_clk(phsuartsetup->baud_rate, phsuartcfg);

  /* Set clock divider for the HS UART */
  switch (phsuartcfg->hsuartnum)
  {
    case 0:
      UART1->rate = phsuartcfg->divider;
      break;

    case 1:
      UART2->rate = phsuartcfg->divider;
      break;

    case 2:
      UART7->rate = phsuartcfg->divider;
      break;

    default:
      err = _ERROR;
      break;
  }

  if (err == _NO_ERROR)
  {
    /* Set CTS control */
    if (phsuartsetup->cts_en)
    {
      phsuartcfg->regptr->ctrl |=	HSU_HCTS_EN;
      /* CTS inversion control */
      if (phsuartsetup->cts_inv)
      {
        phsuartcfg->regptr->ctrl |=	HSU_HCTS_INV;
      }
      else
      {
        phsuartcfg->regptr->ctrl &=	~HSU_HCTS_INV;
      }
    }
    else
    {
      phsuartcfg->regptr->ctrl &=	~HSU_HCTS_EN;
    }

    /* Set RTS control */
    if (phsuartsetup->rts_en)
    {
      phsuartcfg->regptr->ctrl |=	HSU_HRTS_EN;
      /* RTS inversion control */
      if (phsuartsetup->rts_inv)
      {
        phsuartcfg->regptr->ctrl |=	HSU_HRTS_INV;
      }
      else
      {
        phsuartcfg->regptr->ctrl &=	~HSU_HRTS_INV;
      }
    }
    else
    {
      phsuartcfg->regptr->ctrl &=	~HSU_HRTS_EN;
    }
  }

  return err;
}

/***********************************************************************
 * HS UART driver public functions
 **********************************************************************/

/***********************************************************************
 *
 * Function: hsuart_open
 *
 * Purpose: Open the HS UART
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     ipbase: Pointer to a HS UART peripheral block
 *     arg   : Pointer to HS UART setup structure or NULL
 *
 * Outputs: None
 *
 * Returns: The pointer to a HS UART config structure or NULL
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 hs_uart_open(void *ipbase,
                   INT_32 arg)
{
  HSUART_CONTROL_T hsuarttran;
  volatile UNS_32 tmp;
  INT_32 hsuartnum, tptr = (INT_32) NULL;
  HSUART_CONTROL_T *pucfg = (HSUART_CONTROL_T *) arg;

  /* Try to find a matching HSUART number based on the passed pointer */
  hsuartnum = hs_uart_ptr_to_hsuart_num((HSUART_REGS_T *) ipbase);
  if (hsuartnum >= 0)
  {
    /* Has the HS UART been previously initialized? */
    if (hs_uart_dat[hsuartnum].hsuart_init == FALSE)
    {
      /* HS UART is free */
      hs_uart_dat[hsuartnum].hsuart_init = TRUE;
      hs_uart_dat[hsuartnum].hsuartnum = hsuartnum;
      hs_uart_dat[hsuartnum].regptr = (HSUART_REGS_T *) ipbase;

      /* No callbacks by default */
      hs_uart_dat[hsuartnum].cbs.rxcb = NULL;
      hs_uart_dat[hsuartnum].cbs.txcb = NULL;
      hs_uart_dat[hsuartnum].cbs.rxerrcb = NULL;

      /* Install general interrupt handler */
      switch (hsuartnum)
      {
        case 0:
          int_install_irq_handler(IRQ_UART_IIR1,
                                  //uart1_int_handler);
								  hs_uart1_int_handler);
          break;
        case 1:
          int_install_irq_handler(IRQ_UART_IIR2,
                                  //uart2_int_handler);
								  hs_uart2_int_handler);
          break;

        case 2:
          int_install_irq_handler(IRQ_UART_IIR7,
                                  //uart7_int_handler);
								  hs_uart7_int_handler);
          break;
      }

      /* Setup default UART state for 9600 */
      if (pucfg == NULL)
      {
        hsuarttran.baud_rate = 9600;
        hsuarttran.cts_en = FALSE;
        hsuarttran.rts_en = FALSE;
        hs_uart_setup_trans_mode(&hs_uart_dat[hsuartnum], &hsuarttran);
      }
      else
      {
        hs_uart_setup_trans_mode(&hs_uart_dat[hsuartnum], pucfg);
      }

      /* Set FIFO level, and clear pending interrupts */
      hs_uart_dat[hsuartnum].regptr->ctrl = (HSU_HRTS_TRIG_32B | HSU_TMO_INACT_16B |
                                           HSU_OFFSET(0x14) | HSU_RX_TL32B | HSU_TX_TL0B);

      /* Receive, transmit and status interrupts enabled */
      hs_uart_dat[hsuartnum].regptr->ctrl |= HSU_RX_INT_EN | HSU_TX_INT_EN | HSU_ERR_INT_EN;

