IgorSkl/logikaMRZV/LIB/CDL_AV0/csps/lpc32xx/source/lpcAV1_hsuart_driver.c
      /* Return pointer to specific UART structure */
      tptr = (INT_32) & hs_uart_dat[hsuartnum];
    }
  }

  return tptr;
}

/***********************************************************************
 *
 * Function: hsuart_close
 *
 * Purpose: Close the HS UART
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR to the caller as the
 *     device was not previously opened. Otherwise, disable the UART,
 *     set init to FALSE, and return _NO_ERROR to the caller.
 *
 * Parameters:
 *     devid: Pointer to HS UART config structure
 *
 * Outputs: None
 *
 * Returns: The status of the close operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS hs_uart_close(INT_32 devid)
{
  volatile UNS_32 tmp;
  HSUART_CFG_T *phsuart = (HSUART_CFG_T *) devid;
  STATUS status = _NO_ERROR;

  /* Close and disable device if it was previously initialized */
  if (phsuart->hsuart_init == TRUE)
  {
    /* Disable interrupts */
    phsuart->regptr->ctrl &= ~(HSU_ERR_INT_EN | HSU_RX_INT_EN | HSU_TX_INT_EN);

    /* Free UART and Disable timer system clock */
    phsuart->hsuart_init = FALSE;
  }
  else
  {
    status = _ERROR;
  }

  return status;
}

/***********************************************************************
 *
 * Function: uart_ioctl
 *
 * Purpose: UART configuration block
 *
 * Processing:
 *     This function is a large case block. Based on the passed function
 *     and option values, set or get the appropriate UART parameter.
 *
 * Parameters:
 *     devid: Pointer to UART config structure
 *     cmd:   ioctl command
 *     arg:   ioctl argument
 *
 * Outputs: None
 *
 * Returns: The status of the ioctl operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS hs_uart_ioctl(INT_32 devid,
                    INT_32 cmd,
                    INT_32 arg)
{
  HSUART_CBS_T *pcbs;
  HSUART_CFG_T *phsuart = (HSUART_CFG_T *) devid;
  STATUS status = _ERROR;
  UNS_8 dummy = 0;

  (void) dummy;

  /* Close and disable device if it was previously initialized */
  if (phsuart->hsuart_init == TRUE)
  {
    status = _NO_ERROR;

    switch (cmd)
    {
      case HSUART_CLEAR_FIFOS:
        while ((phsuart->regptr->level & 0xFF00) != 0);
        while ((phsuart->regptr->level & 0xFF) != 0)
        {
          dummy =	phsuart->regptr->txrx_fifo;
        }
        break;

      case HSUART_SETUP_TRANSFER:
        hs_uart_setup_trans_mode(phsuart, (HSUART_CONTROL_T *) arg);
        break;

      case HSUART_LOOPBACK_EN:
        if (arg != 0)
        {
          UARTCNTL->loop |=
            UART_LPBACK_ENABLED(phsuart->hsuartnum + 1);
        }
        else
        {
          UARTCNTL->loop &=
            ~UART_LPBACK_ENABLED(phsuart->hsuartnum + 1);
        }
        break;

      case HSUART_FORCE_BREAK:
        if (arg != 0)
        {
          phsuart->regptr->ctrl |= HSU_BREAK;
        }
        else
        {
          phsuart->regptr->ctrl &= ~HSU_BREAK;
        }
        break;

      case HSUART_INSTALL_CBS:
        pcbs = (HSUART_CBS_T *) arg;
        phsuart->cbs.rxcb    = pcbs->rxcb;
        phsuart->cbs.txcb    = pcbs->txcb;
        phsuart->cbs.rxerrcb = pcbs->rxerrcb;
		phsuart->cbs.eofcb    = pcbs->eofcb;
        break;

      case HSUART_GET_STATUS:
        /* Return a UART status */
        switch (arg)
        {
          case HSUART_GET_IP_CLOCK:
            status = clkpwr_get_base_clock_rate(
                       CLKPWR_PERIPH_CLK);
            break;

          case HSUART_GET_DERIVED_CLOCK:
            status = phsuart->baudrate;
            break;

          case HSUART_GET_LINE_STATUS:
            status = (STATUS) phsuart->regptr->iir;
            break;

          default:
            /* Unsupported parameter */
            status = LPC_BAD_PARAMS;
            break;
        }
        break;

      default:
        /* Unsupported parameter */
        status = LPC_BAD_PARAMS;
    }
  }

  return status;
}

/***********************************************************************
 *
 * Function: uart_read
 *
 * Purpose: UART read function (stub only)
 *
 * Processing:
 *     Read the passed number of bytes in the passed buffer, or the
 *     amount of data that is available, whichever is less.
 *
 * Parameters:
 *     devid:     Pointer to UART descriptor
 *     buffer:    Pointer to data buffer to copy to
 *     max_bytes: Number of bytes to read
 *
 * Outputs: None
 *
 * Returns: Number of bytes actually read
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 hs_uart_read(INT_32 devid,
                   void *buffer,
                   INT_32 max_bytes)
{
  INT_32 bread = 0;
  HSUART_CFG_T *phsuart = (HSUART_CFG_T *) devid;
  HSUART_REGS_T *pregs = phsuart->regptr;
  UNS_8 *buff8 = (UNS_8 *) buffer;

  while ((max_bytes > 0) && ((pregs->level & 0xFF) != 0))
  {
    *buff8 = (UNS_8) pregs->txrx_fifo;
    buff8++;
    max_bytes--;
    bread++;
  }

  return bread;
}

/***********************************************************************
 *
 * Function: uart_write
 *
 * Purpose: Timer UART function
 *
 * Processing:
 *     Write the passed number of bytes in the passed buffer to the UART
 *     FIFO, or the amounf of data that the FIFO can handle.
 *
 * Parameters:
 *     devid:   Pointer to UART descriptor
 *     buffer:  Pointer to data buffer to copy from
 *     n_bytes: Number of bytes to write
 *
 * Outputs: None
 *
 * Returns: Number of bytes actually written (always 0)
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 hs_uart_write(INT_32 devid,
                    void *buffer,
                    INT_32 n_bytes)
{
  INT_32 bwrite = 0;
  HSUART_CFG_T *phsuart = (HSUART_CFG_T *) devid;
  HSUART_REGS_T *pregs = phsuart->regptr;
  UNS_8 *buff8 = (UNS_8 *) buffer;

  /* Only add data if the current FIFO level can be determined */
  if (((pregs->level) >> 8) == 0)
  {
    while ((n_bytes > 0) && (((pregs->level) >> 8) == 0))
    {
      pregs->txrx_fifo = (UNS_32) * buff8;
      buff8++;
      n_bytes--;
      bwrite++;
    }

