IgorSkl/logikaMRZV/LIB/CDL_AV0/csps/lpc32xx/source/lpcAV1_hsuart_driver.c
    /* Since the trip point is at 8 bytes, it's ok to add up to
       8 more bytes of data for transmit */
    if (n_bytes > 8)
    {
      n_bytes = 8;
    }
    while (n_bytes > 0)
    {
      pregs->txrx_fifo = (UNS_32) * buff8;
      buff8++;
      n_bytes--;
      bwrite++;
    }
  }

  return bwrite;
}
//static long lMaxTimeTransmit;
INT_32 hs_uart_write1(INT_32 devid,
                    void *buffer,
                    INT_32 n_bytes) @ "Fast_function"
{
  INT_32 bwrite = 0;
  HSUART_CFG_T *phsuart = (HSUART_CFG_T *) devid;
  HSUART_REGS_T *pregs = phsuart->regptr;
  UNS_8 *buff8 = (UNS_8 *) buffer;

  /* Only add data if the current FIFO level can be determined */
  if (((pregs->level) >> 8) < 4)
  {
    while ((n_bytes > 0) && (((pregs->level) >> 8) < 63 ))
    {
      pregs->txrx_fifo = (UNS_32) * buff8;
      buff8++;
      n_bytes--;
      bwrite++;
	    if (n_bytes == 0)
		{
		n_bytes = 0;
		buffer = TIMER_CNTR0;
		lTmrHSU2Val = ((TIMER_CNTR_REGS_T*) buffer)->tc;
		}
    }
	

    /* Since the trip point is at 8 bytes, it's ok to add up to
       8 more bytes of data for transmit /
    if (n_bytes > 8)
    {
      n_bytes = 8;
    }
    while (n_bytes > 0)
    {
      pregs->txrx_fifo = (UNS_32) * buff8;
      buff8++;
      n_bytes--;
      bwrite++;
    }*/
  }

  return bwrite;
}
/***********************************************************************
 *
 * Function: hs_uart_recover
 *
 * Purpose: Close the HS UART
 *
 * Processing:
 *     If init is not TRUE, then return _ERROR to the caller as the
 *     device was not previously opened. Otherwise, disable the UART,
 *     set init to FALSE, and return _NO_ERROR to the caller.
 *
 * Parameters:
 *     devid: Pointer to HS UART config structure
 *
 * Outputs: None
 *
 * Returns: The status of the close operation
 *
 * Notes: None
 *
 **********************************************************************/
STATUS  hs_uart_recover(INT_32 devid)
{
  volatile UNS_32 tmp;
  HSUART_CFG_T *phsuart = (HSUART_CFG_T *) devid;
  //INT_32 hsuartnum = 0;
  STATUS status = _NO_ERROR;
  long dummy = 0;
  (void) dummy;

  /* Close and disable device if it was previously initialized */
  if (phsuart->hsuart_init == TRUE)
  {
    //hsuartnum = hs_uart_ptr_to_hsuart_num((HSUART_REGS_T *) devid);
	/* Disable interrupts */
    phsuart->regptr->ctrl &= ~(HSU_ERR_INT_EN | HSU_RX_INT_EN | HSU_TX_INT_EN);
	phsuart->regptr->ctrl = 0;
	 tmp = phsuart->regptr->rate;
	phsuart->regptr->rate = 0;
	phsuart->regptr->iir  = HSU_BRK_INT|HSU_FE_INT|HSU_RX_OE_INT|HSU_TX_INT ;
	phsuart->regptr->iir  = 0;

    /* Free UART and Disable timer system clock */
    //phsuart->hsuart_init = FALSE;
	dummy =	phsuart->regptr->txrx_fifo;
	hs_uart_ioctl(devid, HSUART_CLEAR_FIFOS, 0);
	
	phsuart->regptr->iir  = HSU_RX_TRIG_INT;
	phsuart->regptr->iir  = 0;
	phsuart->regptr->rate = tmp;
	phsuart->regptr->ctrl =   (HSU_TMO_INACT_16B |
    HSU_OFFSET(0x14) | HSU_RX_TL32B | HSU_TX_TL0B);//HSU_HRTS_TRIG_32B | 
	phsuart->regptr->ctrl |= HSU_RX_INT_EN |   HSU_TX_INT_EN | HSU_ERR_INT_EN;//HSU_RX_INT_EN |
	
  }
  else
  {
    status = _ERROR;
  }

  return status;
}




